<a href=https://uplimit.com/course/r-for-data-science>
  <img src=https://imgur.com/6Vkc11w.png />
</a>

|        |                                   |                                   |                                 |                                |
| -------| ----------------------------------| -------------------------------- -| --------------------------------| ------------------------------------------|
| Week 1 | [[01] Doing Data Science](https://colab.research.google.com/drive/1aWpmzS36qVc8hNIaSSSHexlodwwyMJCB)           | [[02] Data Science in Action](https://colab.research.google.com/drive/1aWpmzS36qVc8hNIaSSSHexlodwwyMJCB)       | [[03] Importing Data](https://colab.research.google.com/drive/13kHBX3H1F2yx5yXWJ5iFZh48qjEtpLjU)             | [[04] Visualizing Data: Overview](https://colab.research.google.com/drive/1JSeDt-Gneegd5B2KwWTJF_igYPb-xsIv)          |
|        | [[05] Transforming Data: Overview](https://colab.research.google.com/drive/1IMZJFE8WmwjgdYCddvaO386PljKq_PjC)  | [[06] Transforming Data: Manipulate](https://colab.research.google.com/drive/19ClnAH7d30I9PkD9KuZndPmy5hxk3gdi) |                                 |                                           |
| Week 2 | [[07] Transforming Data: Aggregate](https://colab.research.google.com/drive/1zigvePewKpzKQHx2pjABXU6Ms8QzQXj7) | [[08] Transforming Data: Reshape](https://colab.research.google.com/drive/1Ma9VrM9SrkNEeXTSul0Ca8a7GHAeNLzC)   | [[09] Transforming Data: Combine](https://colab.research.google.com/drive/1JUGm1h4YPmCkre-rVUj5Ql7lBS66_xIs) | [[10] Visualizing Data: Grammar of Graphics](https://colab.research.google.com/drive/1YLE3NPp-TO2KUTohtidjzKMeqJVWxYoT) |
|        | [[11] Data Science in Action Again](https://colab.research.google.com/drive/1eWjVK4oEiXdwdP4sT0nOJlmkCMBkfLpz) |                                   |                                 |                                           |
Books | [Hands on Programming with R](https://rstudio-education.github.io/hopr/index.html) | [R for Data Science](https://r4ds.hadley.nz/) | [Elegant Graphics for Data Analysis](https://ggplot2-book.org/)

> ðŸ“• __BEFORE YOU GET STARTED:__
> 1. Click on **Copy to Drive** to copy notebook to your drive.
> 2. Click on **Share** on the top-right corner (of your copied notebook).
> 3. Update sharing settings to **Anyone with link**
> 4. Delete this cell.

## Combining Data

__Combining__ data spread across multiple tables is a common task. This is where the `join` and `bind` functions in `dplyr` comes into play.

<img src="https://i.imgur.com/qfpUdFQ.png" height=250px/>

In [ ]:
# Load packages and common utility functions
library(tidyverse)
url = "https://gist.githubusercontent.com/ramnathv/e71d3ffe88961fc4ef95642053012384/raw/9dda53562d06009912841ab3538d4aeb90e5ee09/_common.R"
download.file(url, basename(url))
source("_common.R")

â”€â”€ Attaching core tidyverse packages â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€ tidyverse 2.0.0 â”€â”€
âœ” dplyr     1.1.3     âœ” readr     2.1.4
âœ” forcats   1.0.0     âœ” stringr   1.5.0
âœ” ggplot2   3.4.4     âœ” tibble    3.2.1
âœ” lubridate 1.9.3     âœ” tidyr     1.3.0
âœ” purrr     1.0.2
â”€â”€ Conflicts â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€ tidyverse_conflicts() â”€â”€
âœ– dplyr::filter() masks stats::filter()
âœ– dplyr::lag()    masks stats::lag()
â„¹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
Installing package into â€˜/usr/local/lib/R/site-libraryâ€™
(as â€˜libâ€™ is unspecified)

Tracing function "install.packages" in package "utils"

Tracing function "update.packages" in package "utils"

Installing packages into â€˜/usr/local/lib/R/site-libraryâ€™
(as â€˜libâ€™ is unspecified)

Inspecting installed packages...

### Join

__Joining__ tables means combining the rows of one table with the rows of another based on common columns. In `dplyr`, you can use the `inner_join()`, `left_join()`, `right_join()`, and `full_join()` functions to perform different types of joins.

Let us take two datasets `band_instruments` and `band_members` which contain information on the instruments that different members play and the bands that they belong to. Note that not everyone plays an instrument, and not everyone is in a band.

In [ ]:
band_instruments

  name  plays
1 John  guitar
2 Paul  bass
3 Keith guitar

In [ ]:
band_members

  name band
1 Mick Stones
2 John Beatles
3 Paul Beatles

#### `inner_join()`: Keep only matching rows in both tables

The `inner_join()` function returns only the rows that have matching values in both tables. In this case, we get a table with only those members who play an instrument and belong to a band.

In [ ]:
inner_join(band_instruments, band_members, by = "name")

  name plays  band
1 John guitar Beatles
2 Paul bass   Beatles

#### `left_join()`: Keep all rows in the left table

The `left_join()` function returns all the rows from the left table and the matching rows from the right table. Hence, we have all members who play an instrument, even if they did not belong to a band.

In [ ]:
left_join(band_instruments, band_members, by = "name")

  name  plays  band
1 John  guitar Beatles
2 Paul  bass   Beatles
3 Keith guitar NA

#### `right_join()`: Keep all rows in the right table

The `right_join()` function returns all the rows from the right table and the matching rows from the left table. Hence, we have all members who belong to a band, even if they did not play an instrument.

In [ ]:
right_join(band_instruments, band_members, by = "name")

  name plays  band
1 John guitar Beatles
2 Paul bass   Beatles
3 Mick NA     Stones

#### `full_join()`: Keep all rows in both tables

The `full_join()` function returns all rows from both tables, filling in `NA` for missing values. Here, we get all members whether or not they play an instrument or belong to a band.

In [ ]:
full_join(band_instruments, band_members, by = "name")

  name  plays  band
1 John  guitar Beatles
2 Paul  bass   Beatles
3 Keith guitar NA
4 Mick  NA     Stones

#### `cross_join()`: Cartesian join of both tables

The `cross_join()` function is a cartesian join that matches every row in one table with every row in another table WITHOUT consideration for any matching columns. As a result, we end up with a table with number of rows equaling the product of number of rows of the two tables.

In [ ]:
cross_join(band_instruments, band_members)

  name.x plays  name.y band
1 John   guitar Mick   Stones
2 John   guitar John   Beatles
3 John   guitar Paul   Beatles
4 Paul   bass   Mick   Stones
5 Paul   bass   John   Beatles
6 Paul   bass   Paul   Beatles
7 Keith  guitar Mick   Stones
8 Keith  guitar John   Beatles
9 Keith  guitar Paul   Beatles

#### `semi_join()`: Keep columns with matching rows in the right table

The `semi_join()` function returns all rows from the left table with a match in the right table. It is very similar to the `inner_join()`, but differs in that it ONLY returns the columns in the left table.

In [ ]:
semi_join(band_instruments, band_members, by = "name")
inner_join(band_instruments, band_members, by = "name")

  name plays
1 John guitar
2 Paul bass

  name plays  band
1 John guitar Beatles
2 Paul bass   Beatles

#### `anti_join()`: Keep columns with non-matching rows in the right table

The `anti_join()` function returns all rows from the left table that DONT have a match in the right table. You can think of it as the opposite of `semi_join()`.

In [ ]:
anti_join(band_instruments, band_members, by = "name")

  name  plays
1 Keith guitar

### Bind

While the `join` functions combine two tables by matching rows, the `bind` functions combine them by stacking them along rows or columns.

#### `bind_rows()`: Bind multiple data frames by row

In [ ]:
df1 <- tibble(x = 1:2, y = letters[1:2])
df2 <- tibble(x = 4:5, z = 1:2)
bind_rows(df1, df2)

  x y  z
1 1 a  NA
2 2 b  NA
3 4 NA  1
4 5 NA  2

#### `bind_cols()`: Bind multiple data frames by column

In [ ]:
df1 <- tibble(x = 1:3)
df2 <- tibble(y = 3:1)
bind_cols(df1, df2)

  x y
1 1 3
2 2 2
3 3 1